# 1. HANDLING MISSING VALUES

In [1]:
import pandas as pd

In [2]:
emp_df = pd.read_csv('/Users/risharane/Downloads/employee_1.csv')

In [3]:
emp_df.shape

(10, 2)

In [4]:
emp_df.head()

     NAME   AGE
0     Tom  21.0
1   Alice  27.0
2  Joseph  24.0
3     NaN  29.0
4   David   NaN

In [5]:
# CHECKING NULL VALUES
emp_df.isna().sum()

NAME    2
AGE     2
dtype: int64

### 1.1 HANDLING MISSING STRING VALUES

**METHOD 1 : Fillling Missing Values with word 'missing'**

In [7]:
emp_df.isna().sum()

NAME    2
AGE     2
dtype: int64

In [8]:
emp_df['NAME'] = emp_df['NAME'].fillna('missing')

In [9]:
# CHECKING NULL VALUES
emp_df.isna().sum()

NAME    0
AGE     2
dtype: int64

**METHOD 2 : Dropping Rows containing Missing Values from NAME column**

In [16]:
emp_df = pd.read_csv('/Users/risharane/Downloads/employee_1.csv')

In [13]:
emp_df.isna().sum()

NAME    2
AGE     2
dtype: int64

In [14]:
emp_df.dropna(inplace = True)

In [15]:
emp_df.isna().sum()

NAME    0
AGE     0
dtype: int64

### 1.2  HANDLING MISSING NUMERIC VALUES

**METHOD 1 : Fillling Missing Values with word Mean/Median/Standard Deviation of that column'**

In [17]:
df = pd.read_csv('/Users/risharane/Downloads/employee_1.csv')

In [18]:
df.isna().sum()

NAME    2
AGE     2
dtype: int64

ON THE PLACE OF MEAN IT CAN ALSO TAKE MEDIAN, STANDARD DEVIATION, MAXIMUM, MINIMUM OF THE COLUMN

In [19]:
df['AGE'] = df['AGE'].fillna(df['AGE'].mean())

In [21]:
df.isna().sum()

NAME    2
AGE     0
dtype: int64

**METHOD 2 : Dropping Rows containing Missing Values from AGE column**

In [22]:
df = pd.read_csv('/Users/risharane/Downloads/employee_1.csv')

In [23]:
df.isna().sum()

NAME    2
AGE     2
dtype: int64

In [24]:
df.dropna(inplace = True)

In [25]:
df.isna().sum()

NAME    0
AGE     0
dtype: int64

**METHOD 3 : Using IMPUTATION Module**

In [26]:
df = pd.read_csv('/Users/risharane/Downloads/employee_1.csv')

In [27]:
df.isna().sum()

NAME    2
AGE     2
dtype: int64

In [30]:
from sklearn.impute import SimpleImputer
imputer = SimpleImputer(strategy='mean')
df['AGE'] = imputer.fit_transform(df[['AGE']])

In [31]:
df.isna().sum()

NAME    2
AGE     0
dtype: int64

# 2.  DATA STANDARDIZATION

In [32]:
# MANUALLY CREATING DATAFRAME

df1 = pd.DataFrame({
    'name' : ['Tom', 'David', 'Novak', 'Pauly'],
    'phone_no' : [123456789, '(123)-456-789', '123-456-789', 536678898],
    'email':['tom@gmail.com', 'david2_4@gmail.com', '21345.dypit@dypvp.edu.in','paul111@gmail.com'],
    'complaint':['I have issue with my order #417890', 'I have a problem with my order number 578390', 'My order 738923 not received', 'Order not received with number 249743']
})

In [33]:
df1.head()

,name,phone_no,email,complaint
0,Tom,123456789,tom@gmail.com,I have issue with my order #417890
1,David,(123)-456-789,david2_4@gmail.com,I have a problem with my order number 578390
2,Novak,123-456-789,21345.dypit@dypvp.edu.in,My order 738923 not received
3,Pauly,536678898,paul111@gmail.com,Order not received with number 249743

### 2.1 Standardizing phone_no column

In [34]:
import re

In [43]:
def standardize_phoneno(text):
    return re.sub(r'\D', '',text)

In [44]:
df1['phone_no'] = df1['phone_no'].apply(standardize_phoneno)

In [50]:
df1.head()

,name,phone_no,email,complaint
0,Tom,123456789,tom@gmail.com,I have issue with my order #417890
1,David,123456789,david2_4@gmail.com,I have a problem with my order number 578390
2,Novak,123456789,21345.dypit@dypvp.edu.in,My order 738923 not received
3,Pauly,536678898,paul111@gmail.com,Order not received with number 249743

### 2.2 Extracting Order No's from the complaint column

In [51]:
def extract_orderno(text):
    return re.findall(r'(?:order|Order)[^\d]*(\d*)', text)

In [52]:
df1['order_no'] = df1['complaint'].apply(extract_orderno)

In [53]:
df1.head()

,name,phone_no,email,complaint,order_no
0,Tom,123456789,tom@gmail.com,I have issue with my order #417890,[417890]
1,David,123456789,david2_4@gmail.com,I have a problem with my order number 578390,[578390]
2,Novak,123456789,21345.dypit@dypvp.edu.in,My order 738923 not received,[738923]
3,Pauly,536678898,paul111@gmail.com,Order not received with number 249743,[249743]

# 3. DELETING UNWANTED COLUMNS

In [54]:
df = pd.read_csv('/Users/risharane/Downloads/employee_1.csv')

In [55]:
df.head()

     NAME   AGE
0     Tom  21.0
1   Alice  27.0
2  Joseph  24.0
3     NaN  29.0
4   David   NaN

DELETING NAME COLUMN

In [56]:
df.drop(columns = ['NAME'], inplace = True)

In [57]:
df.head()

    AGE
0  21.0
1  27.0
2  24.0
3  29.0
4   NaN